

# Этот код создает объекты игры
#план:
#задати платформу, м'яч(яким будемо пуляти), м'ячі(які будут стояти),
#задати 3 життя(lives)


from pgzero.actor import Actor

#----------------------------------------------------------------------------------------------------------
# Класс Ball создает объект мяча для игры
class Ball(Actor):
    pass
#----------------------------------------------------------------------------------------------------------
# Класс Obstacle создает объект преграды для игры(шари)
class Obstacle(Actor):
    pass
#----------------------------------------------------------------------------------------------------------
