import pgzrun
from new_vector import Vector
from actors import Ball, Life, Obstacle, Paddle # импортируем классы игровых актеров

WIDTH = 800
HEIGHT = 800
#
# #----------------------------------------------------------------------------------------------------------
# # Создаем объекты игровых актеров
# paddle = Paddle(300, 785)  # ракетка с начальными координатами
# ball = Ball(100, 300)  # мяч с начальными координатами
#
#
# #----------------------------------------------------------------------------------------------------------
# # Функция, отвечающая за отрисовку игрового поля
# def draw():
#     pass
#
# #----------------------------------------------------------------------------------------------------------
# # Функция, отвечающая за логику игры
# def update():
#     pass
# #----------------------------------------------------------------------------------------------------------
# # Функция, отвечающая за передвижение ракетки при движении мыши
# def on_mouse_move(pos):
#     # paddle.x = pos[0]  # изменяем координату ракетки по оси X
#     pass
# #----------------------------------------------------------------------------------------------------------
# # Функция, отвечающая за потерю жизни при вылете мяча
# def lose_life():
#     pass
#

pgzrun.go()
